In [1]:
import pandas as pd
import numpy as np

In [9]:
ls

 Volume in drive C is Windows
 Volume Serial Number is 04E0-B438

 Directory of C:\Users\luisp\Desktop\Cursos\python\Jupiter_Notebooks\db

03/12/2022  17:00    <DIR>          .
03/12/2022  17:00    <DIR>          ..
03/12/2022  09:23         1,034,821 london_merged.csv
03/10/2022  22:10         4,769,811 Meteorite_landings.csv
03/12/2022  17:00            29,719 poblacion.csv
03/10/2022  17:17               163 test.csv
03/10/2022  21:41            84,959 test.hdf
03/10/2022  21:11               388 test.json
03/10/2022  21:39             4,639 test.parquet
03/10/2022  21:37             1,179 test.pkl
03/10/2022  21:11             5,176 text.xlsx
               9 File(s)      5,930,855 bytes
               2 Dir(s)  161,979,985,920 bytes free

In [12]:
pd.options.display.float_format = '{:,.1f}'.format #colocar formato de decimales

In [13]:
df_pob =pd.read_csv('poblacion.csv')
df_pob

                       Country  year             pop
0                  Afghanistan  2015    34,413,603.0
1                      Albania  2015     2,880,703.0
2                      Algeria  2015    39,728,025.0
3               American Samoa  2015        55,812.0
4                      Andorra  2015        78,011.0
...                        ...   ...             ...
1035  Pre-demographic dividend  2018   919,485,393.0
1036              Small states  2018    40,575,321.0
1037                South Asia  2018 1,814,388,744.0
1038   South Asia (IDA & IBRD)  2018 1,814,388,744.0
1039        Sub-Saharan Africa  2018 1,078,306,520.0

[1040 rows x 3 columns]

In [17]:
df_pob['year'] = pd.Categorical(df_pob['year'].apply(str))

In [18]:
df_pob.dtypes

Country      object
year       category
pop         float64
dtype: object

In [71]:
filtro2 = df_pob[(df_pob['Country'] == 'Aruba') | (df_pob['Country'] == 'Colombia')] #otra manera de filtrar
filtro2

      Country  year          pop
9       Aruba  2015    104,341.0
42   Colombia  2015 47,520,667.0
269     Aruba  2016    104,872.0
302  Colombia  2016 48,171,392.0
529     Aruba  2017    105,366.0
562  Colombia  2017 48,901,066.0
789     Aruba  2018    105,845.0
822  Colombia  2018 49,648,685.0

In [99]:
idx_filtro = df_pob['Country'].isin(['Aruba', 'Colombia']) #metodo isin crea un vector de variable booleanas que permite filtrar.
idx_filtro

0       False
1       False
2       False
3       False
4       False
        ...
1035    False
1036    False
1037    False
1038    False
1039    False
Name: Country, Length: 1040, dtype: bool

In [106]:
df_sample = df_pob[idx_filtro]
df_sample

      Country  year          pop
9       Aruba  2015    104,341.0
42   Colombia  2015 47,520,667.0
269     Aruba  2016    104,872.0
302  Colombia  2016 48,171,392.0
529     Aruba  2017    105,366.0
562  Colombia  2017 48,901,066.0
789     Aruba  2018    105,845.0
822  Colombia  2018 49,648,685.0

In [77]:
#df_sample.index

Int64Index([9, 42, 269, 302, 529, 562, 789, 822], dtype='int64')

In [98]:
#df_sample.index = df_sample[['year','Country']] #otra manera de asignar index concatenando columnas.
df_sample.head()

                   Country  year          pop
(2015, Aruba)        Aruba  2015    104,341.0
(2015, Colombia)  Colombia  2015 47,520,667.0
(2016, Aruba)        Aruba  2016    104,872.0
(2016, Colombia)  Colombia  2016 48,171,392.0
(2017, Aruba)        Aruba  2017    105,366.0

In [96]:
#df_sample.transpose()

,"(2015, Aruba)","(2015, Colombia)","(2016, Aruba)","(2016, Colombia)","(2017, Aruba)","(2017, Colombia)","(2018, Aruba)","(2018, Colombia)"
Country,Aruba,Colombia,Aruba,Colombia,Aruba,Colombia,Aruba,Colombia
year,2015,2015,2016,2016,2017,2017,2018,2018
pop,"104,341.0","47,520,667.0","104,872.0","48,171,392.0","105,366.0","48,901,066.0","105,845.0","49,648,685.0"

In [107]:
df_sample.set_index(['Country', 'year']).sort_index() # set one or more indexes, and sort index.

                       pop
Country  year
Aruba    2015    104,341.0
         2016    104,872.0
         2017    105,366.0
         2018    105,845.0
Colombia 2015 47,520,667.0
         2016 48,171,392.0
         2017 48,901,066.0
         2018 49,648,685.0

In [108]:
df_sample = df_sample.set_index(['Country', 'year']).sort_index()
df_sample

                       pop
Country  year
Aruba    2015    104,341.0
         2016    104,872.0
         2017    105,366.0
         2018    105,845.0
Colombia 2015 47,520,667.0
         2016 48,171,392.0
         2017 48,901,066.0
         2018 49,648,685.0

In [122]:
df_sample.loc['Colombia', :]

              pop
year
2015 47,520,667.0
2016 48,171,392.0
2017 48,901,066.0
2018 49,648,685.0

In [126]:
df_sample.loc['Colombia',:].loc['2016',:] #acceder a indices especificos.

pop   48,171,392.0
Name: 2016, dtype: float64

In [130]:
df_sample.xs(('Aruba', '2018')) # acceder a indices especificos.

pop   105,845.0
Name: (Aruba, 2018), dtype: float64

In [131]:
df_sample.xs('2018', level='year')

                  pop
Country
Aruba       105,845.0
Colombia 49,648,685.0

In [134]:
df_countries = df_pob.set_index(['Country', 'year']).sort_index(ascending = [True, True]) #trabajar con multiples indices.
df_countries

                          pop
Country     year
Afghanistan 2015 34,413,603.0
            2016 35,383,128.0
            2017 36,296,400.0
            2018 37,172,386.0
Albania     2015  2,880,703.0
...                       ...
Zambia      2018 17,351,822.0
Zimbabwe    2015 13,814,629.0
            2016 14,030,390.0
            2017 14,236,745.0
            2018 14,439,018.0

[1040 rows x 1 columns]

In [135]:
ids = pd.IndexSlice
df_countries.loc[ids['Aruba':'Austria','2015':'2017'], :].sort_index()

                        pop
Country   year
Aruba     2015    104,341.0
          2016    104,872.0
          2017    105,366.0
Australia 2015 23,815,995.0
          2016 24,190,907.0
          2017 24,601,860.0
Austria   2015  8,642,699.0
          2016  8,736,668.0
          2017  8,797,566.0

In [137]:
df_countries.index.get_level_values(0) #seleccionar indices por niveles, countries.

Index(['Afghanistan', 'Afghanistan', 'Afghanistan', 'Afghanistan', 'Albania',
       'Albania', 'Albania', 'Albania', 'Algeria', 'Algeria',
       ...
       'Yemen, Rep.', 'Yemen, Rep.', 'Zambia', 'Zambia', 'Zambia', 'Zambia',
       'Zimbabwe', 'Zimbabwe', 'Zimbabwe', 'Zimbabwe'],
      dtype='object', name='Country', length=1040)

In [138]:
df_countries.index.get_level_values(1) #seleccionar indices por niveles, year

CategoricalIndex(['2015', '2016', '2017', '2018', '2015', '2016', '2017',
                  '2018', '2015', '2016',
                  ...
                  '2017', '2018', '2015', '2016', '2017', '2018', '2015',
                  '2016', '2017', '2018'],
                 categories=['2015', '2016', '2017', '2018'], ordered=False, dtype='category', name='year', length=1040)

In [141]:
df_countries['pop']['Colombia']['2018'] #cadenas de instrucciones a un datafrmae con multiples indices.

49648685.0

In [142]:
df_countries.sum(level='year')

C:\Users\luisp\AppData\Local\Temp/ipykernel_4692/2999234035.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df_countries.sum(level='year')

                  pop
year
2015 65,679,147,019.0
2016 66,487,930,677.0
2017 67,294,176,701.0
2018 68,087,886,692.0

In [143]:
df_sample.unstack('year')

                  pop
year             2015         2016         2017         2018
Country
Aruba       104,341.0    104,872.0    105,366.0    105,845.0
Colombia 47,520,667.0 48,171,392.0 48,901,066.0 49,648,685.0

In [144]:
df_sample.unstack('Country')

              pop
Country     Aruba     Colombia
year
2015    104,341.0 47,520,667.0
2016    104,872.0 48,171,392.0
2017    105,366.0 48,901,066.0
2018    105,845.0 49,648,685.0